witalis3/UA3REO-DDC-Transceiver/STM32/Src/settings.c
		println("[OK] Loaded default settings");
		LCD_showError("Loaded default settings", true);
		SaveSettings();
		SaveSettingsToEEPROM();
	}
}

static void LoadSettingsFromEEPROM(void)
{
	EEPROM_PowerUp();
	uint8_t tryes = 0;
	while (tryes < EEPROM_REPEAT_TRYES && !EEPROM_Read_Data((uint8_t *)&TRX, sizeof(TRX), EEPROM_SECTOR_SETTINGS, true, false))
	{
		tryes++;
	}
	if (tryes >= EEPROM_REPEAT_TRYES)
		println("[ERR] Read EEPROM SETTINGS multiple errors");
	EEPROM_PowerDown();
}

void LoadCalibration(bool clear)
{
	EEPROM_PowerUp();
	uint8_t tryes = 0;
	while (tryes < EEPROM_REPEAT_TRYES && !EEPROM_Read_Data((uint8_t *)&CALIBRATE, sizeof(CALIBRATE), EEPROM_SECTOR_CALIBRATION, true, false))
	{
		tryes++;
	}
	if (tryes >= EEPROM_REPEAT_TRYES)
		println("[ERR] Read EEPROM CALIBRATE multiple errors");

	if (CALIBRATE.ENDBit != 100 || CALIBRATE.flash_id != CALIB_VERSION || clear || CALIBRATE.csum != calculateCSUM_EEPROM()) // code for checking the firmware in the eeprom, if it does not match, we use the default
	{
		println("[ERR] CALIBRATE Flash check CODE:", CALIBRATE.flash_id, false);
		CALIBRATE.flash_id = CALIB_VERSION; // code for checking the firmware in the eeprom, if it does not match, we use the default

		CALIBRATE.ENCODER_INVERT = false;	  // invert left-right rotation of the main encoder
		CALIBRATE.ENCODER2_INVERT = false;	  // invert left-right rotation of the optional encoder
		CALIBRATE.ENCODER_DEBOUNCE = 0;		  // time to eliminate contact bounce at the main encoder, ms
		CALIBRATE.ENCODER2_DEBOUNCE = 50;	  // time to eliminate contact bounce at the additional encoder, ms
		CALIBRATE.ENCODER_SLOW_RATE = 25;	  // slow down the encoder for high resolutions
		CALIBRATE.ENCODER_ON_FALLING = false; // encoder only triggers when level A falls
		CALIBRATE.ENCODER_ACCELERATION = 75;  //acceleration rate if rotate
		CALIBRATE.CICFIR_GAINER_val = 48;	  // Offset from the output of the CIC compensator
		CALIBRATE.TXCICFIR_GAINER_val = 42;	  // Offset from the TX-CIC output of the compensator
		CALIBRATE.DAC_GAINER_val = 26;		  // DAC shift
		// Calibrate the maximum output power for each band
		CALIBRATE.rf_out_power_2200m = 29;		   //2200m
		CALIBRATE.rf_out_power_160m = 29;		   //160m
		CALIBRATE.rf_out_power_80m = 27;		   //80m
		CALIBRATE.rf_out_power_40m = 26;	   //40m
		CALIBRATE.rf_out_power_30m = 26;	   //30m
		CALIBRATE.rf_out_power_20m = 24;	   //20m
		CALIBRATE.rf_out_power_17m = 24;	   //17m
		CALIBRATE.rf_out_power_15m = 24;	   //15m
		CALIBRATE.rf_out_power_12m = 24;	   //12m
		CALIBRATE.rf_out_power_10m = 24;	   //10m
		CALIBRATE.rf_out_power_6m = 13;	   //6m
		CALIBRATE.rf_out_power_2m = 100;		   //2m
		CALIBRATE.smeter_calibration = 0;		   // S-Meter calibration, set when calibrating the transceiver to S9 (ATT, PREAMP off)
		CALIBRATE.adc_offset = 0;				   // Calibrate the offset at the ADC input (DC)
												   // Bandwidth frequency data from BPF filters (taken with GKCH or set by sensitivity), Hz
												   // Next, the average border response frequencies are set
		CALIBRATE.LPF_END = 60000 * 1000;		   //LPF
		CALIBRATE.BPF_0_START = 135 * 1000 * 1000; //2m U14-RF3
		CALIBRATE.BPF_0_END = 150 * 1000 * 1000;   //2m
		CALIBRATE.BPF_1_START = 1500 * 1000;	   //160m U16-RF2
		CALIBRATE.BPF_1_END = 2400 * 1000;		   //160m
		CALIBRATE.BPF_2_START = 2400 * 1000;	   //80m U16-RF4
		CALIBRATE.BPF_2_END = 4700 * 1000;		   //80m
		CALIBRATE.BPF_3_START = 4700 * 1000;	   //40m U16-RF1
		CALIBRATE.BPF_3_END = 7200 * 1000;		   //40m
		CALIBRATE.BPF_4_START = 7200 * 1000;	   //30m U16-RF3
		CALIBRATE.BPF_4_END = 11500 * 1000;		   //30m
		CALIBRATE.BPF_5_START = 11500 * 1000;	   //20,17m U14-RF2
		CALIBRATE.BPF_5_END = 21000 * 1000;		   //20,17m
		CALIBRATE.BPF_6_START = 21000 * 1000;	   //15,12,10,6m U14-RF4
		CALIBRATE.BPF_6_END = 64000 * 1000;		   //15,12,10,6m
		CALIBRATE.BPF_HPF = 60000 * 1000;		   //HPF U14-RF1
		CALIBRATE.SWR_FWD_Calibration = 11.0f;		   //SWR Transormator rate forward
		CALIBRATE.SWR_REF_Calibration = 11.0f;		   //SWR Transormator rate return
		CALIBRATE.VCXO_correction = 16;			   //VCXO Frequency offset
		CALIBRATE.FW_AD8307_SLP = 25.5f;		   //Slope for the log amp used to mreasure the FW power (mV/dB)
		CALIBRATE.FW_AD8307_OFFS = 1150.0f;		   //Offset to back calculate the output voltage to dBm (mV)
		CALIBRATE.BW_AD8307_SLP = 25.5f;		   //Slope for the log amp used to mreasure the BW power (mV/dB)
		CALIBRATE.BW_AD8307_OFFS = 1150.0f;		   //Offset to back calculate the output voltage to dBm (mV)
		CALIBRATE.FAN_MEDIUM_START = 50;			// Temperature at which the fan starts at half power
		CALIBRATE.FAN_MEDIUM_STOP = 40;				// Temperature at which the fan stops
		CALIBRATE.FAN_FULL_START = 70;				// Temperature at which the fan starts at full power
		CALIBRATE.TRX_MAX_RF_TEMP = 80;				// Maximum RF unit themperature to enable protect
		CALIBRATE.TRX_MAX_SWR = 5;						// Maximum SWR to enable protect on TX (NOT IN TUNE MODE!)
		CALIBRATE.FM_DEVIATION_SCALE = 10;			// FM Deviation scale
		CALIBRATE.TUNE_MAX_POWER = 2;					// Maximum RF power in Tune mode

		CALIBRATE.ENDBit = 100; // Bit for the end of a successful write to eeprom
		println("[OK] Loaded default calibrate settings");
		LCD_showError("Loaded default calibrations", true);
		SaveCalibration();
	}
	EEPROM_PowerDown();
}

inline VFO *CurrentVFO(void)
{
	if (!TRX.current_vfo)
		return &TRX.VFO_A;
	else
		return &TRX.VFO_B;
}

inline VFO *SecondaryVFO(void)
{
	if (!TRX.current_vfo)
		return &TRX.VFO_B;
	else
		return &TRX.VFO_A;
}

void SaveSettings(void)
{
	BKPSRAM_Enable();
	TRX.csum = calculateCSUM();
	Aligned_CleanDCache_by_Addr((uint32_t *)&TRX, sizeof(TRX));
	if (settings_bank == 1)
	{
		dma_memcpy(BACKUP_SRAM_BANK1_ADDR, &TRX, sizeof(TRX));
		Aligned_CleanDCache_by_Addr(BACKUP_SRAM_BANK1_ADDR, sizeof(TRX));
		dma_memset(BACKUP_SRAM_BANK2_ADDR, 0x00, sizeof(TRX));
		Aligned_CleanDCache_by_Addr(BACKUP_SRAM_BANK2_ADDR, sizeof(TRX));
	}
	else
	{
		dma_memcpy(BACKUP_SRAM_BANK2_ADDR, &TRX, sizeof(TRX));
		Aligned_CleanDCache_by_Addr(BACKUP_SRAM_BANK2_ADDR, sizeof(TRX));
		dma_memset(BACKUP_SRAM_BANK1_ADDR, 0x00, sizeof(TRX));
		Aligned_CleanDCache_by_Addr(BACKUP_SRAM_BANK1_ADDR, sizeof(TRX));
	}
	BKPSRAM_Disable();
	NeedSaveSettings = false;
	//sendToDebug_str("[OK] Settings Saved to bank ");
	//sendToDebug_uint8(settings_bank, false);
	//sendToDebug_uint32(sizeof(TRX), false);
	if (settings_bank == 1)
		settings_bank = 2;
	else
		settings_bank = 1;
}

